In [1]:
import pandas as pd

import re

In [2]:
data = pd.read_csv('./job_offer.csv', sep= ",", decimal=".", encoding= "UTF-8")

data.head()

,Name,Company,Location,Technologies,Salary Low,Salary High,Currency
0,Mid SQL Data Analyst,Ośrodek Przetwarzania Informacji - Państwowy I...,Warszawa,Data SQL pandas Python,8000.0,10000.0,PLN
1,Data Analyst,Ferrosan Medical Devices,Szczecin,Data Python Degree Data science,14000.0,24000.0,PLN
2,Data Analyst,Volvo Group,Wrocław,Data SQL Azure Power BI,12000.0,18000.0,PLN
3,QA/ Data Analyst,AVENGA,Wrocław,Testing SQL QlikView PySpark,16800.0,20000.0,PLN
4,Data Analyst,Cognitum Services SA,Warszawa,Data AWS SQL Data analysis,17000.0,23000.0,PLN

In [3]:
data_pln = data.query("Currency == 'PLN'")

data_pln['Currency'].unique()

array(['PLN'], dtype=object)

In [4]:
# Změňte názvy nabídek práce a měst ( name a location_citysloupců) na malá písmena,
# .lower() přepíše na malá písmena
data_pln['Name'] = data_pln['Name'].apply(lambda x: x.lower())
data_pln['Location'] = data_pln['Location'].apply(lambda x: x.lower())
data_pln.head(3)

/var/folders/ly/b4ncvmb902ggx_hbc9vc3qy40000gp/T/ipykernel_58312/1000614602.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_pln['Name'] = data_pln['Name'].apply(lambda x: x.lower())
/var/folders/ly/b4ncvmb902ggx_hbc9vc3qy40000gp/T/ipykernel_58312/1000614602.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_pln['Location'] = data_pln['Location'].apply(lambda x: x.lower())

,Name,Company,Location,Technologies,Salary Low,Salary High,Currency
0,mid sql data analyst,Ośrodek Przetwarzania Informacji - Państwowy I...,warszawa,Data SQL pandas Python,8000.0,10000.0,PLN
1,data analyst,Ferrosan Medical Devices,szczecin,Data Python Degree Data science,14000.0,24000.0,PLN
2,data analyst,Volvo Group,wrocław,Data SQL Azure Power BI,12000.0,18000.0,PLN

In [5]:
# Přidat nový salary_avg sloupec jako průměr sloupců salary_high a salary_low,
data_pln['Salary_avg'] = (data_pln['Salary Low'] + data_pln['Salary High']) / 2
data_pln.head(3)

/var/folders/ly/b4ncvmb902ggx_hbc9vc3qy40000gp/T/ipykernel_58312/3401121976.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_pln['Salary_avg'] = (data_pln['Salary Low'] + data_pln['Salary High']) / 2

,Name,Company,Location,Technologies,Salary Low,Salary High,Currency,Salary_avg
0,mid sql data analyst,Ośrodek Przetwarzania Informacji - Państwowy I...,warszawa,Data SQL pandas Python,8000.0,10000.0,PLN,9000.0
1,data analyst,Ferrosan Medical Devices,szczecin,Data Python Degree Data science,14000.0,24000.0,PLN,19000.0
2,data analyst,Volvo Group,wrocław,Data SQL Azure Power BI,12000.0,18000.0,PLN,15000.0

In [6]:
data_pln['Location'].unique()

array(['warszawa', 'szczecin', 'wrocław', 'remote', 'gdynia', 'warsaw',
       'poznań', 'tczew', 'gdańsk', 'ostrów', 'kraków', 'kobyłka', 'łódź'],
      dtype=object)

In [7]:
data_pln.loc[data_pln['Location'].isin(['warszawa']), 'Location'] = 'warsaw'

data_pln['Location'].unique()

array(['warsaw', 'szczecin', 'wrocław', 'remote', 'gdynia', 'poznań',
       'tczew', 'gdańsk', 'ostrów', 'kraków', 'kobyłka', 'łódź'],
      dtype=object)

In [8]:
data_pln['Country'] = "PL"

data_pln.loc[data_pln['Location'] == 'remote', 'Country'] = 'N/A'

data_pln['Country'].unique()

/var/folders/ly/b4ncvmb902ggx_hbc9vc3qy40000gp/T/ipykernel_58312/3266679374.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_pln['Country'] = "PL"

array(['PL', 'N/A'], dtype=object)

In [9]:
data_pln['Senior'] = 0
data_pln.loc[data_pln['Name'].apply(lambda x: True if re.search('senior', x) else False),'Senior'] = 1

data_pln['Senior'].unique()

/var/folders/ly/b4ncvmb902ggx_hbc9vc3qy40000gp/T/ipykernel_58312/2867785815.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_pln['Senior'] = 0

array([0, 1])

In [10]:
data_pln['Pozice'] = 0
data_pln.loc[data_pln['Name'].apply(lambda x: True if re.search('scientist', x) else False),'Pozice'] = 'scientist'
data_pln.loc[data_pln['Name'].apply(lambda x: True if re.search('analyst', x) else False),'Pozice'] = 'analyst'
data_pln.loc[data_pln['Name'].apply(lambda x: True if re.search('engineer', x) else False),'Pozice'] = 'engineer'

/var/folders/ly/b4ncvmb902ggx_hbc9vc3qy40000gp/T/ipykernel_58312/1615881937.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_pln['Pozice'] = 0
/var/folders/ly/b4ncvmb902ggx_hbc9vc3qy40000gp/T/ipykernel_58312/1615881937.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'scientist' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  data_pln.loc[data_pln['Name'].apply(lambda x: True if re.search('scientist', x) else False),'Pozice'] = 'scientist'

In [11]:
data_pln.to_csv('./job_offers_2024_08_18.csv',
    sep=';',
    encoding='UTF-8',
    index=False)